package HomeWork_Lesson1;

import java.util.Arrays;

public class Advanse {
    public static void main(String[] args) {

        //Продвинутый уровень
        //Задача №1
        //Произвести преобразование текста "234" в число типа int и прибавить к этому числу длину строки "some_text"
        //coments fstart
//        String text = "234";
//        int number = Integer.valueOf(text);//преобразование текста "234" в число типа int
//        String text2 = "some_text";
//        int lenghtText2 = text2.length();//длина строки "some_text"
//        int answer = number + lenghtText2;//конечное решение
//
//        System.out.println(number);
//        System.out.println(lenghtText2);
//        System.out.println(answer);
//
//
//        //Задача №2
//        //Посчитать (a+b)^2 = ?, при a=3, b=5
////
//        int result = test.function(3, 5);
//        System.out.println(result);
////    }
//    public static int function (int a, int b) {
//        return (a+b) * (a+b); // Я вообще не понял этот метод. Не въехал в него.
////        //Но я не списывал. Сам решил, но по анологии.
        //coments fin
//    }


        //Задача №3
        //Создать два массив чисел:
        // 1,2,5,7,10
        // 2,3,2,17,15
        // Создать массив чисел, в котором будут: все числа из этих двух массивов,
        // и результат умножения чисел с одинаковым порядковым номером
        //
        //Ожидаемый результат:
        //1,2,5,7,10,2,3,2,17,15,2,6,10,119,150
        //(первый массив - 1,2,5,7,10), (второй массив - 2,3,2,17,15),
        //(результат перемножения - (1*2), (2*3), (5*2), (7*17), (10*15)
//        {
//    int[] array1 = new int[]{1, 2, 5, 7, 10};
//    int[] array2 = new int[]{2, 3, 2, 17, 15};
//    int[] result = new int[15];
//        for (int i = 0; i < 5; i++) {
//            result[i] = array1[i];
////            result[i + 5] = array2[i];
//            result[i + 10] = array1[i] + array2[i];
//        }
//        System.out.println(Arrays.toString(result));


//        //Задача №4
//        //В слове "Hello world!" заменить l на r, сделать все буквы заглавными, выбрать первые 8 символов, вывести на экран
//            String HelloWorld = "Hello world";
//            String result = HelloWorld.replaceAll("l", "r").toUpperCase().substring(0, 8);
//
//            System.out.println(result);

    }
}